[{"title":"A Haunted House","author":"Virginia Woolf","challenge":"Whatever hour you woke there was a door shutting. From room to room they went, hand in hand, lifting here, opening there, making sure--a ghostly couple. \"Here we left it,\" she said. And he added, \"Oh, but here tool\" \"It's upstairs,\" she murmured. \"And in the garden,\" he whispered. \"Quietly,\" they said, \"or we shall wake them.\" But it wasn't that you woke us. Oh, no. \"They're looking for it; they're drawing the curtain,\" one might say, and so read on a page or two. \"Now they've found it,' one would be certain, stopping the pencil on the margin. And then, tired of reading, one might rise and see for oneself, the house all empty, the doors standing open, only the wood pigeons bubbling with content and the hum of the threshing machine sounding from the farm. \"What did I come in here for? What did I want to find?\" My hands were empty. \"Perhaps its upstairs then?\" The apples were in the loft. And so down again, the garden still as ever, only the book had slipped into the grass. But they had found it in the drawing room. Not that one could ever see them. The windowpanes reflected apples, reflected roses; all the leaves were green in the glass. If they moved in the drawing room, the apple only turned its yellow side. Yet, the moment after, if the door was opened, spread about the floor, hung upon the walls, pendant from the ceiling--what? My hands were empty. The shadow of a thrush crossed the carpet; from the deepest wells of silence the wood pigeon drew its bubble of sound. \"Safe, safe, safe\" the pulse of the house beat softly. \"The treasure buried; the room . . .\" the pulse stopped short. Oh, was that the buried treasure? A moment later the light had faded. Out in the garden then? But the trees spun darkness for a wandering beam of sun. So fine, so rare, coolly sunk beneath the surface the beam I sought always burned behind the glass. Death was the glass; death was between us, coming to the woman first, hundreds of years ago, leaving the house, sealing all the windows; the rooms were darkened. He left it, left her, went North, went East, saw the stars turned in the Southern sky; sought the house, found it dropped beneath the Downs. \"Safe, safe, safe,\" the pulse of the house beat gladly. 'The Treasure yours.\" The wind roars up the avenue. Trees stoop and bend this way and that. Moonbeams splash and spill wildly in the rain. But the beam of the lamp falls straight from the window. The candle burns stiff and still. Wandering through the house, opening the windows, whispering not to wake us, the ghostly couple seek their joy. \"Here we slept,\" she says. And he adds, \"Kisses without number.\" \"Waking in the morning--\" \"Silver between the trees--\" \"Upstairs--\" 'In the garden--\" \"When summer came--\" 'In winter snowtime--\" \"The doors go shutting far in the distance, gently knocking like the pulse of a heart. Nearer they come, cease at the doorway. The wind falls, the rain slides silver down the glass. Our eyes darken, we hear no steps beside us; we see no lady spread her ghostly cloak. His hands shield the lantern. \"Look,\" he breathes. \"Sound asleep. Love upon their lips.\" Stooping, holding their silver lamp above us, long they look and deeply. Long they pause. The wind drives straightly; the flame stoops slightly. Wild beams of moonlight cross both floor and wall, and, meeting, stain the faces bent; the faces pondering; the faces that search the sleepers and seek their hidden joy. \"Safe, safe, safe,\" the heart of the house beats proudly. \"Long years--\" he sighs. \"Again you found me.\" \"Here,\" she murmurs, \"sleeping; in the garden reading; laughing, rolling apples in the loft. Here we left our treasure--\" Stooping, their light lifts the lids upon my eyes. \"Safe! safe! safe!\" the pulse of the house beats wildly. Waking, I cry \"Oh, is this your buried treasure? The light in the heart.\" "},{"title":"A Wicked Woman","author":"Jack London","challenge":"It was because she had broken with Billy that Loretta had come visiting to Santa Clara. Billy could not understand. His sister had reported that he had walked the floor and cried all night. Loretta had not slept all night either, while she had wept most of the night. Daisy knew this, because it was in her arms that the weeping had been done. And Daisy's husband, Captain Kitt, knew, too. The tears of Loretta, and the comforting by Daisy, had lost him some sleep. Now Captain Kitt did not like to lose sleep. Neither did he want Loretta to marry Billy--nor anybody else. It was Captain Kitt's belief that Daisy needed the help of her younger sister in the household. But he did not say this aloud. Instead, he always insisted that Loretta was too young to think of marriage. So it was Captain Kitt's idea that Loretta should be packed off on a visit to Mrs. Hemingway. There wouldn't be any Billy there. Before Loretta had been at Santa Clara a week, she was convinced that Captain Kitt's idea was a good one. In the first place, though Billy wouldn't believe it, she did not want to marry Billy. And in the second place, though Captain Kitt wouldn't believe it, she did not want to leave Daisy. By the time Loretta had been at Santa Clara two weeks, she was absolutely certain that she did not want to marry Billy. But she was not so sure about not wanting to leave Daisy. Not that she loved Daisy less, but that she--had doubts. The day of Loretta's arrival, a nebulous plan began shaping itself in Mrs. Hemingway's brain. The second day she remarked to Jack Hemingway, her husband, that Loretta was so innocent a young thing that were it not for her sweet guilelessness she would be positively stupid. In proof of which, Mrs. Hemingway told her husband several things that made him chuckle. By the third day Mrs. Hemingway's plan had taken recognizable form. Then it was that she composed a letter. On the envelope she wrote: \"Mr. Edward Bashford, Athenian Club, San Francisco.\" \"Dear Ned,\" the letter began. She had once been violently loved by him for three weeks in her pre-marital days. But she had covenanted herself to Jack Hemingway, who had prior claims, and her heart as well; and Ned Bashford had philosophically not broken his heart over it. He merely added the experience to a large fund of similarly collected data out of which he manufactured philosophy. Artistically and temperamentally he was a Greek-- a tired Greek. He was fond of quoting from Nietzsche, in token that he, too, had passed through the long sickness that follows upon the ardent search for truth; that he too had emerged, too experienced, too shrewd, too profound, ever again to be afflicted by the madness of youths in their love of truth. \"'To worship appearance,'\" he often quoted; \"'to believe in forms, in tones, in words, in the whole Olympus of appearance!'\" This particular excerpt he always concluded with, \"'Those Greeks were superficial--OUT OF PROFUNDITY!'\" He was a fairly young Greek, jaded and worn. Women were faithless and unveracious, he held--at such times that he had relapses and descended to pessimism from his wonted high philosophical calm. He did not believe in the truth of women; but, faithful to his German master, he did not strip from them the airy gauzes that veiled their untruth. He was content to accept them as appearances and to make the best of it. He was superficial- -OUT OF PROFUNDITY. \"Jack says to be sure to say to you, 'good swimming,'\" Mrs. Hemingway wrote in her letter; \"and also 'to bring your fishing duds along.'\" Mrs. Hemingway wrote other things in the letter. She told him that at last she was prepared to exhibit to him an absolutely true, unsullied, and innocent woman. \"A more guileless, immaculate bud of womanhood never blushed on the planet,\" was one of the several ways in which she phrased the inducement. And to her husband she said triumphantly, \"If I don't marry Ned off this time--\" leaving unstated the terrible alternative that she lacked either vocabulary to express or imagination to conceive. Contrary to all her forebodings, Loretta found that she was not unhappy at Santa Clara. Truly, Billy wrote to her every day, but his letters were less distressing than his presence. Also, the ordeal of being away from Daisy was not so severe as she had expected. For the first time in her life she was not lost in eclipse in the blaze of Daisy's brilliant and mature personality. Under such favourable circumstances Loretta came rapidly to the front, while Mrs. Hemingway modestly and shamelessly retreated into the background. Loretta began to discover that she was not a pale orb shining by reflection. Quite unconsciously she became a small centre of things. When she was at the piano, there was some one to turn the pages for her and to express preferences for certain songs. When she dropped her handkerchief, there was some one to pick it up. And there was some one to accompany her in ramblings and flower gatherings. Also, she learned to cast flies in still pools and below savage riffles, and how not to entangle silk lines and gut-leaders with the shrubbery. Jack Hemingway did not care to teach beginners, and fished much by himself, or not at all, thus giving Ned Bashford ample time in which to consider Loretta as an appearance. As such, she was all that his philosophy demanded. Her blue eyes had the direct gaze of a boy, and out of his profundity he delighted in them and forbore to shudder at the duplicity his philosophy bade him to believe lurked in their depths. She had the grace of a slender flower, the fragility of colour and line of fine china, in all of which he pleasured greatly, without thought of the Life Force palpitating beneath and in spite of Bernard Shaw--in whom he believed. Loretta burgeoned. She swiftly developed personality. She discovered a will of her own and wishes of her own that were not everlastingly entwined with the will and the wishes of Daisy. She was petted by Jack Hemingway, spoiled by Alice Hemingway, and devotedly attended by Ned Bashford. They encouraged her whims and laughed at her follies, while she developed the pretty little tyrannies that are latent in all pretty and delicate women. Her environment acted as a soporific upon her ancient desire always to live with Daisy. This desire no longer prodded her as in the days of her companionship with Billy. The more she saw of Billy, the more certain she had been that she could not live away from Daisy. The more she saw of Ned Bashford, the more she forgot her pressing need of Daisy. Ned Bashford likewise did some forgetting. He confused superficiality with profundity, and entangled appearance with reality until he accounted them one. Loretta was different from other women. There was no masquerade about her. She was real. He said as much to Mrs. Hemingway, and more, who agreed with him and at the same time caught her husband's eyelid drooping down for the moment in an unmistakable wink. It was at this time that Loretta received a letter from Billy that was somewhat different from his others. In the main, like all his letters, it was pathological. It was a long recital of symptoms and sufferings, his nervousness, his sleeplessness, and the state of his heart. Then followed reproaches, such as he had never made before. They were sharp enough to make her weep, and true enough to put tragedy into her face. This tragedy she carried down to the breakfast table. It made Jack and Mrs. Hemingway speculative, and it worried Ned. They glanced to him for explanation, but he shook his head. \"I'll find out to-night,\" Mrs. Hemingway said to her husband. But Ned caught Loretta in the afternoon in the big living-room. She tried to turn away. He caught her hands, and she faced him with wet lashes and trembling lips. He looked at her, silently and kindly. The lashes grew wetter. \"There, there, don't cry, little one,\" he said soothingly. He put his arm protectingly around her shoulder. And to his shoulder, like a tired child, she turned her face. He thrilled in ways unusual for a Greek who has recovered from the long sickness. \"Oh, Ned,\" she sobbed on his shoulder, \"if you only knew how wicked I am!\" He smiled indulgently, and breathed in a great breath freighted with the fragrance of her hair. He thought of his world-experience of women, and drew another long breath. There seemed to emanate from her the perfect sweetness of a child--\"the aura of a white soul,\" was the way he phrased it to himself. Then he noticed that her sobs were increasing. \"What's the matter, little one?\" he asked pettingly and almost paternally. \"Has Jack been bullying you? Or has your dearly beloved sister failed to write?\" She did not answer, and he felt that he really must kiss her hair, that he could not be responsible if the situation continued much longer. \"Tell me,\" he said gently, \"and we'll see what I can do.\" \"I can't. You will despise me.--Oh, Ned, I am so ashamed!\" He laughed incredulously, and lightly touched her hair with his lips--so lightly that she did not know. \"Dear little one, let us forget all about it, whatever it is. I want to tell you how I love--\" She uttered a sharp cry that was all delight, and then moaned-- \"Too late!\" \"Too late?\" he echoed in surprise. \"Oh, why did I? Why did I?\" she was moaning. He was aware of a swift chill at his heart. \"What?\" he asked. \"Oh, I . . . he . . . Billy. \"I am such a wicked woman, Ned. I know you will never speak to me again.\" \"This--er--this Billy,\" he began haltingly. \"He is your brother?\" \"No . . . he . . . I didn't know. I was so young. I could not help it. Oh, I shall go mad! I shall go mad!\" It was then that Loretta felt his shoulder and the encircling arm become limp. He drew away from her gently, and gently he deposited her in a big chair, where she buried her face and sobbed afresh. He twisted his moustache fiercely, then drew up another chair and sat down. \"I--I do not understand,\" he said. \"I am so unhappy,\" she wailed. \"Why unhappy?\" \"Because . . . he . . . he wants me to marry him.\" His face cleared on the instant, and he placed a hand soothingly on hers. \"That should not make any girl unhappy,\" he remarked sagely. \"Because you don't love him is no reason--of course, you don't love him?\" Loretta shook her head and shoulders in a vigorous negative. \"What?\" Bashford wanted to make sure. \"No,\" she asserted explosively. \"I don't love Billy! I don't want to love Billy!\" \"Because you don't love him,\" Bashford resumed with confidence, \"is no reason that you should be unhappy just because he has proposed to you.\" She sobbed again, and from the midst of her sobs she cried-- \"That's the trouble. I wish I did love him. Oh, I wish I were dead!\" \"Now, my dear child, you are worrying yourself over trifles.\" His other hand crossed over after its mate and rested on hers. \"Women do it every day. Because you have changed your mind or did not know your mind, because you have--to use an unnecessarily harsh word--jilted a man--\" \"Jilted!\" She had raised her head and was looking at him with tear-dimmed eyes. \"Oh, Ned, if that were all!\" \"All?\" he asked in a hollow voice, while his hands slowly retreated from hers. He was about to speak further, then remained silent. \"But I don't want to marry him,\" Loretta broke forth protestingly. \"Then I shouldn't,\" he counselled. \"But I ought to marry him.\" \"OUGHT to marry him?\" She nodded. \"That is a strong word.\" \"I know it is,\" she acquiesced, while she strove to control her trembling lips. Then she spoke more calmly. \"I am a wicked woman, a terribly wicked woman. No one knows how wicked I am--except Billy.\" There was a pause. Ned Bashford's face was grave, and he looked queerly at Loretta. \"He--Billy knows?\" he asked finally. A reluctant nod and flaming cheeks was the reply. He debated with himself for a while, seeming, like a diver, to be preparing himself for the plunge. \"Tell me about it.\" He spoke very firmly. \"You must tell me all of it.\" \"And will you--ever--forgive me?\" she asked in a faint, small voice. He hesitated, drew a long breath, and made the plunge. \"Yes,\" he said desperately. \"I'll forgive you. Go ahead.\" \"There was no one to tell me,\" she began. \"We were with each other so much. I did not know anything of the world--then.\" She paused to meditate. Bashford was biting his lip impatiently. \"If I had only known--\" She paused again. \"Yes, go on,\" he urged. \"We were together almost every evening.\" \"Billy?\" he demanded, with a savageness that startled her. \"Yes, of course, Billy. We were with each other so much . . . If I had only known . . . There was no one to tell me . . . I was so young--\" Her lips parted as though to speak further, and she regarded him anxiously. \"The scoundrel!\" With the explosion Ned Bashford was on his feet, no longer a tired Greek, but a violently angry young man. \"Billy is not a scoundrel; he is a good man,\" Loretta defended, with a firmness that surprised Bashford. \"I suppose you'll be telling me next that it was all your fault,\" he said sarcastically. She nodded. \"What?\" he shouted. \"It was all my fault,\" she said steadily. \"I should never have let him. I was to blame.\" Bashford ceased from his pacing up and down, and when he spoke, his voice was resigned. \"All right,\" he said. \"I don't blame you in the least, Loretta. And you have been very honest. But Billy is right, and you are wrong. You must get married.\" \"To Billy?\" she asked, in a dim, far-away voice. \"Yes, to Billy. I'll see to it. Where does he live? I'll make him.\" \"But I don't want to marry Billy!\" she cried out in alarm. \"Oh, Ned, you won't do that?\" \"I shall,\" he answered sternly. \"You must. And Billy must. Do you understand?\" Loretta buried her face in the cushioned chair back, and broke into a passionate storm of sobs. All that Bashford could make out at first, as he listened, was: \"But I don't want to leave Daisy! I don't want to leave Daisy!\" He paced grimly back and forth, then stopped curiously to listen. \"How was I to know?--Boo--hoo,\" Loretta was crying. \"He didn't tell me. Nobody else ever kissed me. I never dreamed a kiss could be so terrible . . . until, boo-hoo . . . until he wrote to me. I only got the letter this morning.\" His face brightened. It seemed as though light was dawning on him. \"Is that what you're crying about?\" \"N--no.\" His heart sank. \"Then what are you crying about?\" he asked in a hopeless voice. \"Because you said I had to marry Billy. And I don't want to marry Billy. I don't want to leave Daisy. I don't know what I want. I wish I were dead.\" He nerved himself for another effort. \"Now look here, Loretta, be sensible. What is this about kisses. You haven't told me everything?\" \"I--I don't want to tell you everything.\" She looked at him beseechingly in the silence that fell. \"Must I?\" she quavered finally. \"You must,\" he said imperatively. \"You must tell me everything.\" \"Well, then . . . must I?\" \"You must.\" \"He . . . I . . . we . . .\" she began flounderingly. Then blurted out, \"I let him, and he kissed me.\" \"Go on,\" Bashford commanded desperately. \"That's all,\" she answered. \"All?\" There was a vast incredulity in his voice. \"All?\" In her voice was an interrogation no less vast. \"I mean--er--nothing worse?\" He was overwhelmingly aware of his own awkwardness. \"Worse?\" She was frankly puzzled. \"As though there could be! Billy said- -\" \"When did he say it?\" Bashford demanded abruptly. \"In his letter I got this morning. Billy said that my . . . our . . . our kisses were terrible if we didn't get married.\" Bashford's head was swimming. \"What else did Billy say?\" he asked. \"He said that when a woman allowed a man to kiss her, she always married him--that it was terrible if she didn't. It was the custom, he said; and I say it is a bad, wicked custom, and I don't like it. I know I'm terrible,\" she added defiantly, \"but I can't help it.\" Bashford absent-mindedly brought out a cigarette. \"Do you mind if I smoke?\" he asked, as he struck a match. Then he came to himself. \"I beg your pardon,\" he cried, flinging away match and cigarette. \"I don't want to smoke. I didn't mean that at all. What I mean is--\" He bent over Loretta, caught her hands in his, then sat on the arm of the chair and softly put one arm around her. \"Loretta, I am a fool. I mean it. And I mean something more. I want you to be my wife.\" He waited anxiously in the pause that followed. \"You might answer me,\" he urged. \"I will . . . if--\" \"Yes, go on. If what?\" \"If I don't have to marry Billy.\" \"You can't marry both of us,\" he almost shouted. \"And it isn't the custom . . . what. . . what Billy said?\" \"No, it isn't the custom. Now, Loretta, will you marry me?\" \"Don't be angry with me,\" she pouted demurely. He gathered her into his arms and kissed her. \"I wish it were the custom,\" she said in a faint voice, from the midst of the embrace, \"because then I'd have to marry you, Ned dear . . . wouldn't I?\" "},{"title":"The Masque of the Red Death","author":"Edgar Allan Poe","challenge":"The red death had long devastated the country. No pestilence had ever been so fatal, or so hideous. Blood was its Avatar and its seal--the madness and the horror of blood. There were sharp pains, and sudden dizziness, and then profuse bleeding at the pores, with dissolution. The scarlet stains upon the body and especially upon the face of the victim, were the pest ban which shut him out from the aid and from the sympathy of his fellow-men. And the whole seizure, progress, and termination of the disease, were incidents of half an hour. But Prince Prospero was happy and dauntless and sagacious. When his dominions were half depopulated, he summoned to his presence a thousand hale and light-hearted friends from among the knights and dames of his court, and with these retired to the deep seclusion of one of his crenellated abbeys. This was an extensive and magnificent structure, the creation of the prince's own eccentric yet august taste. A strong and lofty wall girdled it in. This wall had gates of iron. The courtiers, having entered, brought furnaces and massy hammers and welded the bolts. They resolved to leave means neither of ingress nor egress to the sudden impulses of despair or of frenzy from within. The abbey was amply provisioned. With such precautions the courtiers might bid defiance to contagion. The external world could take care of itself. In the meantime it was folly to grieve or to think. The prince had provided all the appliances of pleasure. There were buffoons, there were improvisatori, there were ballet-dancers, there were musicians, there was Beauty, there was wine. All these and security were within. Without was the \"Red Death.\" It was toward the close of the fifth or sixth month of his seclusion that the Prince Prospero entertained his thousand friends at a masked ball of the most unusual magnificence. It was a voluptuous scene, that masquerade. But first let me tell of the rooms in which it was held. There were seven--an imperial suite, In many palaces, however, such suites form a long and straight vista, while the folding doors slide back nearly to the walls on either hand, so that the view of the whole extant is scarcely impeded. Here the case was very different; as might have been expected from the duke's love of the \"bizarre.\" The apartments were so irregularly disposed that the vision embraced but little more than one at a time. There was a sharp turn at the right and left, in the middle of each wall, a tall and narrow Gothic window looked out upon a closed corridor of which pursued the windings of the suite. These windows were of stained glass whose color varied in accordance with the prevailing hue of the decorations of the chamber into which it opened. That at the eastern extremity was hung, for example, in blue--and vividly blue were its windows. The second chamber was purple in its ornaments and tapestries, and here the panes were purple. The third was green throughout, and so were the casements. The fourth was furnished and lighted with orange--the fifth with white--the sixth with violet. The seventh apartment was closely shrouded in black velvet tapestries that hung all over the ceiling and down the walls, falling in heavy folds upon a carpet of the same material and hue. But in this chamber only, the color of the windows failed to correspond with the decorations. The panes were scarlet--a deep blood color. Now in no one of any of the seven apartments was there any lamp or candelabrum, amid the profusion of golden ornaments that lay scattered to and fro and depended from the roof. There was no light of any kind emanating from lamp or candle within the suite of chambers. But in the corridors that followed the suite, there stood, opposite each window, a heavy tripod, bearing a brazier of fire, that projected its rays through the tinted glass and so glaringly lit the room. And thus were produced a multitude of gaudy and fantastic appearances. But in the western or back chamber the effect of the fire-light that streamed upon the dark hangings through the blood-tinted panes was ghastly in the extreme, and produced so wild a look upon the countenances of those who entered, that there were few of the company bold enough to set foot within its precincts at all. It was within this apartment, also, that there stood against the western wall, a gigantic clock of ebony. It pendulum swung to and fro with a dull, heavy, monotonous clang; and when the minute-hand made the circuit of the face, and the hour was to be stricken, there came from the brazen lungs of the clock a sound which was clear and loud and deep and exceedingly musical, but of so peculiar a note and emphasis that, at each lapse of an hour, the musicians of the orchestra were constrained to pause, momentarily, in their performance, to hearken to the sound; and thus the waltzers perforce ceased their evolutions; and there was a brief disconcert of the whole gay company; and while the chimes of the clock yet rang. it was observed that the giddiest grew pale, and the more aged and sedate passed their hands over their brows as if in confused revery or meditation. But when the echoes had fully ceased, a light laughter at once pervaded the assembly; the musicians looked at each other and smiled as if at their own nervousness and folly, and made whispering vows, each to the other, that the next chiming of the clock should produce in them no similar emotion; and then, after the lapse of sixty minutes (which embrace three thousand and six hundred seconds of Time that flies), there came yet another chiming of the clock, and then were the same disconcert and tremulousness and meditation as before. But, in spite of these things, it was a gay and magnificent revel. The tastes of the duke were peculiar. He had a fine eye for color and effects. He disregarded the \"decora\" of mere fashion. His plans were bold and fiery, and his conceptions glowed with barbaric lustre. There are some who would have thought him mad. His followers felt that he was not. It was necessary to hear and see and touch him to be _sure_ he was not. He had directed, in great part, the movable embellishments of the seven chambers, upon occasion of this great fete; and it was his own guiding taste which had given character to the masqueraders. Be sure they were grotesque. There were much glare and glitter and piquancy and phantasm--much of what has been seen in \"Hernani.\" There were arabesque figures with unsuited limbs and appointments. There were delirious fancies such as the madman fashions. There were much of the beautiful, much of the wanton, much of the bizarre, something of the terrible, and not a little of that which might have excited disgust. To and fro in the seven chambers stalked, in fact, a multitude of dreams. And these the dreams--writhed in and about, taking hue from the rooms, and causing the wild music of the orchestra to seem as the echo of their steps. And, anon, there strikes the ebony clock which stands in the hall of the velvet. And then, for a moment, all is still, and all is silent save the voice of the clock. The dreams are stiff-frozen as they stand. But the echoes of the chime die away--they have endured but an instant--and a light half-subdued laughter floats after them as they depart. And now the music swells, and the dreams live, and writhe to and fro more merrily than ever, taking hue from the many-tinted windows through which stream the rays of the tripods. But to the chamber which lies most westwardly of the seven there are now none of the maskers who venture, for the night is waning away; and there flows a ruddier light through the blood-colored panes; and the blackness of the sable drapery appalls; and to him whose foot falls on the sable carpet, there comes from the near clock of ebony a muffled peal more solemnly emphatic than any which reaches _their_ ears who indulge in the more remote gaieties of the other apartments. But these other apartments were densely crowded, and in them beat feverishly the heart of life. And the revel went whirlingly on, until at length there commenced the sounding of midnight upon the clock. And then the music ceased, as I have told; and the evolutions of the waltzers were quieted; and there was an uneasy cessation of all things as before. But now there were twelve strokes to be sounded by the bell of the clock; and thus it happened, perhaps that more of thought crept, with more of time into the meditations of the thoughtful among those who revelled. And thus too, it happened, that before the last echoes of the last chime had utterly sunk into silence, there were many individuals in the crowd who had found leisure to become aware of the presence of a masked figure which had arrested the attention of no single individual before. And the rumor of this new presence having spread itself whisperingly around, there arose at length from the whole company a buzz, or murmur, of horror, and of disgust. In an assembly of phantasms such as I have painted, it may well be supposed that no ordinary appearance could have excited such sensation. In truth the masquerade license of the night was nearly unlimited; but the figure in question had out-Heroded Herod, and gone beyond the bounds of even the prince's indefinite decorum. There are chords in the hearts of the most reckless which cannot be touched without emotion. Even with the utterly lost, to whom life and death are equally jests, there are matters of which no jest can be made. The whole company, indeed, seemed now deeply to feel that in the costume and bearing of the stranger neither wit nor propriety existed. The figure was tall and gaunt, and shrouded from head to foot in the habiliments of the grave. The mask which concealed the visage was made so nearly to resemble the countenance of a stiffened corpse that the closest scrutiny must have difficulty in detecting the cheat. And yet all this might have been endured, if not approved, by the mad revellers around. But the mummer had gone so far as to assume the type of the Red Death. His vesture was dabbled in _blood_--and his broad brow, with all the features of his face, was besprinkled with the scarlet horror. When the eyes of Prince Prospero fell on this spectral image (which, with a slow and solemn movement, as if more fully to sustain its role, stalked to and fro among the waltzers) he was seen to be convulsed, in the first moment with a strong shudder either of terror or distaste; but in the next, his brow reddened with rage. \"Who dares\"--he demanded hoarsely of the courtiers who stood near him--\"who dares insult us with this blasphemous mockery? Seize him and unmask him--that we may know whom we have to hang, at sunrise, from the battlements!\" It was in the eastern or blue chamber in which stood Prince Prospero as he uttered these words. They rang throughout the seven rooms loudly and clearly, for the prince was a bold and robust man, and the music had become hushed at the waving of his hand. It was in the blue room where stood the prince, with a group of pale courtiers by his side. At first, as he spoke, there was a slight rushing movement of this group in the direction of the intruder, who, at the moment was also near at hand, and now, with deliberate and stately step, made closer approach to the speaker. But from a certain nameless awe with which the mad assumptions of the mummer had inspired the whole party, there were found none who put forth a hand to seize him; so that, unimpeded, he passed within a yard of the prince's person; and while the vast assembly, as with one impulse, shrank from the centers of the rooms to the walls, he made his way uninterruptedly, but with the same solemn and measured step which had distinguished him from the first, through the blue chamber to the purple--to the purple to the green--through the green to the orange--through this again to the white--and even thence to the violet, ere a decided movement had been made to arrest him. It was then, however, that the Prince Prospero, maddened with rage and the shame of his own momentary cowardice, rushed hurriedly through the six chambers, while none followed him on account of a deadly terror that had seized upon all. He bore aloft a drawn dagger, and had approached, in rapid impetuosity, to within three or four feet of the retreating figure, when the latter, having attained the extremity of the velvet apartment, turned suddenly and confronted his pursuer. There was a sharp cry--and the dagger dropped gleaming upon the sable carpet, upon which most instantly afterward, fell prostrate in death the Prince Prospero. Then summoning the wild courage of despair, a throng of the revellers at once threw themselves into the black apartment, and seizing the mummer whose tall figure stood erect and motionless within the shadow of the ebony clock, gasped in unutterable horror at finding the grave cerements and corpse-like mask, which they handled with so violent a rudeness, untenanted by any tangible form. And now was acknowledged the presence of the red death. He had come like a thief in the night. And one by one dropped the revellers in the blood-bedewed halls of their revel, and died each in the despairing posture of his fall. And the life of the ebony clock went out with that of the last of the gay. And the flames of the tripods expired. And darkness and decay and the red death held illimitable dominion over all. "},{"title":"TAJIMA","author":"Miss Mitford","challenge":"Once upon a time, a certain ronin, Tajima Shume by name, an able and well-read man, being on his travels to see the world, went up to Kiyoto by the Tokaido. [The road of the Eastern Sea, the famous highroad leading from Kiyoto to Yedo. The name is also used to indicate the provinces through which it runs.] One day, in the neighbourhood of Nagoya, in the province of Owari, he fell in with a wandering priest, with whom he entered into conversation. Finding that they were bound for the same place, they agreed to travel together, beguiling their weary way by pleasant talk on divers matters; and so by degrees, as they became more intimate, they began to speak without restraint about their private affairs; and the priest, trusting thoroughly in the honour of his companion, told him the object of his journey. \"For some time past,\" said he, \"I have nourished a wish that has engrossed all my thoughts; for I am bent on setting up a molten image in honour of Buddha; with this object I have wandered through various provinces collecting alms, and (who knows by what weary toil?) we have succeeded in amassing two hundred ounces of silver--enough, I trust, to erect a handsome bronze figure.\" What says the proverb? \"He who bears a jewel in his bosom bears poison.\" Hardly had the ronin heard these words of the priest than an evil heart arose within him, and he thought to himself, \"Man's life, from the womb to the grave, is made up of good and of ill luck. Here am I, nearly forty years old, a wanderer, without a calling, or even a hope of advancement in the world. To be sure, it seems a shame; yet if I could steal the money this priest is boasting about, I could live at ease for the rest of my days;\" and so he began casting about how best he might compass his purpose. But the priest, far from guessing the drift of his comrade's thoughts, journeyed cheerfully on till they reached the town of Kuana. Here there is an arm of the sea, which is crossed in ferry-boats, that start as soon as some twenty or thirty passengers are gathered together; and in one of these boats the two travellers embarked. About half-way across, the priest was taken with a sudden necessity to go to the side of the boat; and the ronin, following him, tripped him up while no one was looking, and flung him into the sea. When the boatmen and passengers heard the splash, and saw the priest struggling in the water, they were afraid, and made every effort to save him; but the wind was fair, and the boat running swiftly under the bellying sails; so they were soon a few hundred yards off from the drowning man, who sank before the boat could be turned to rescue him. When he saw this, the ronin feigned the utmost grief and dismay, and said to his fellow-passengers, \"This priest, whom we have just lost, was my cousin; he was going to Kiyoto, to visit the shrine of his patron; and as I happened to have business there as well, we settled to travel together. Now, alas! by this misfortune, my cousin is dead, and I am left alone.\" He spoke so feelingly, and wept so freely, that the passengers believed his story, and pitied and tried to comfort him. Then the ronin said to the boatmen: \"We ought, by rights, to report this matter to the authorities; but as I am pressed for time, and the business might bring trouble on yourselves as well, perhaps we had better hush it up for the present; I will at once go on to Kiyoto and tell my cousin's patron, besides writing home about it. What think you, gentlemen?\" added he, turning to the other travellers. They, of course, were only too glad to avoid any hindrance to their onward journey, and all with one voice agreed to what the ronin had proposed; and so the matter was settled. When, at length, they reached the shore, they left the boat, and every man went his way; but the ronin, overjoyed in his heart, took the wandering priest's luggage, and, putting it with his own, pursued his journey to Kiyoto. On reaching the capital, the ronin changed his name from Shume to Tokubei, and, giving up his position as a samurai, turned merchant, and traded with the dead man's money. Fortune favouring his speculations, he began to amass great wealth, and lived at his ease, denying himself nothing; and in course of time he married a wife, who bore him a child. Thus the days and months wore on, till one fine summer's night, some three years after the priest's death, Tokubei stepped out on the veranda of his house to enjoy the cool air and the beauty of the moonlight. Feeling dull and lonely, he began musing over all kinds of things, when on a sudden the deed of murder and theft, done so long ago, vividly recurred to his memory, and he thought to himself, \"Here am I, grown rich and fat on the money I wantonly stole. Since then, all has gone well with me; yet, had I not been poor, I had never turned assassin nor thief. Woe betide me! what a pity it was!\" and as he was revolving the matter in his mind, a feeling of remorse came over him, in spite of all he could do. While his conscience thus smote him, he suddenly, to his utter amazement, beheld the faint outline of a man standing near a fir-tree in the garden; on looking more attentively, he perceived that the man's whole body was thin and worn, and the eyes sunken and dim; and in that poor ghost that was before him he recognised the very priest whom he had thrown into the sea at Kuana. Chilled with horror, he looked again, and saw that the priest was smiling in scorn. He would have fled into the house, but the ghost stretched forth its withered arm, and, clutching the back of his neck, scowled at him with a vindictive glare and a hideous ghastliness of mien so unspeakably awful that any ordinary man would have swooned with fear. But Tokubei, tradesman though he was, had once been a soldier, and was not easily matched for daring; so he shook off the ghost, and, leaping into the room for his dirk, laid about him boldly enough; but, strike as he would, the spirit, fading into the air, eluded his blows, and suddenly reappeared only to vanish again; and from that time forth Tokubei knew no rest, and was haunted night and day. At length, undone by such ceaseless vexation, Tokubei fell ill, and kept muttering, \"Oh, misery! misery! the wandering priest is coming to torture me!\" Hearing his moans and the disturbance he made, the people in the house fancied he was mad, and called in a physician, who prescribed for him. But neither pill nor potion could cure Tokubei, whose strange frenzy soon became the talk of the whole neighbourhood. Now it chanced that the story reached the ears of a certain wandering priest who lodged in the next street. When he heard the particulars, this priest gravely shook his head as though he knew all about it, and sent a friend to Tokubei's house to say that a wandering priest, dwelling hard by, had heard of his illness, and, were it never so grievous, would undertake to heal it by means of his prayers; and Tokubei's wife, driven half wild by her husband's sickness, lost not a moment in sending for the priest and taking him into the sick man's room. But no sooner did Tokubei see the priest than he yelled out, \"Help! help! Here is the wandering priest come to torment me again. Forgive! forgive!\" and hiding his head under the coverlet, he lay quivering all over. Then the priest turned all present out of the room, put his mouth to the affrighted man's ear, and whispered: \"Three years ago, at the Kuana ferry, you flung me into the water; and well you remember it.\" But Tokubei was speechless, and could only quake with fear. \"Happily,\" continued the priest, \"I had learned to swim and to dive as a boy; so I reached the shore, and, after wandering through many provinces, succeeded in setting up a bronze figure to Buddha, thus fulfilling the wish of my heart. On my journey homeward, I took a lodging in the next street, and there heard of your marvellous ailment. Thinking I could divine its cause, I came to see you, and am glad to find I was not mistaken. You have done a hateful deed; but am I not a priest, and have I not forsaken the things of this world, and would it not ill become me to bear malice? Repent, therefore, and abandon your evil ways. To see you do so I should esteem the height of happiness. Be of good cheer, now, and look me in the face, and you will see that I am really a living man, and no vengeful goblin come to torment you.\" Seeing he had no ghost to deal with, and overwhelmed by the priest's kindness, Tokubei burst into tears, and answered, \"Indeed, indeed, I don't know what to say. In a fit of madness I was tempted to kill and rob you. Fortune befriended me ever after; but the richer I grew, the more keenly I felt how wicked I had been, and the more I foresaw that my victim's vengeance would some day overtake me. Haunted by this thought, I lost my nerve, till one night I beheld your spirit, and from that time fell ill. But how you managed to escape, and are still alive, is more than I can understand.\" \"A guilty man,\" said the priest, with a smile, \"shudders at the rustling of the wind or the chattering of a stork's beak; a murderer's conscience preys upon his mind till he sees what is not. Poverty drives a man to crimes which he repents of in his wealth. How true is the doctrine of Moshi [Mencius], that the heart of man, pure by nature, is corrupted by circumstances!\" Thus he held forth; and Tokubei, who had long since repented of his crime, implored forgiveness, and gave him a large sum of money, saying, \"Half of this is the amount I stole from you three years since; the other half I entreat you to accept as interest, or as a gift.\" The priest at first refused the money; but Tokubei insisted on his accepting it, and did all he could to detain him, but in vain; for the priest went on his way, and bestowed the money on the poor and needy. As for Tokubei himself, he soon shook off his disorder, and thenceforward lived at peace with all men, revered both at home and abroad, and ever intent on good and charitable deeds. "},{"title":"THE REVENGE OF HER RACE","author":"Mary Beaumont","challenge":"The low hedge, where the creepers climbed, divided the lawn and its magnificent Wellingtonias from the meadow. There was little grass to be seen, for it was at this time one vast profusion of delicate ixias of every bright and tender shade. The evening was still, and the air heavy with scent. In a room opening upon the veranda wreathed with white-and-scarlet passion-flowers, where she could see the garden and the meadow, and, beyond all, the Mountain Beautiful, lay a sick woman. Her dark face was lovely as an autumn leaf is lovely--hectic with the passing life. Her eyes wandered to the upper snows of the mountain, from time to time resting upon the brown-haired English girl who sat on a low stool by her side, holding the frail hand in her cool, firm clasp. The invalid was speaking; her voice was curiously sweet, and there was a peculiarity about the \"s,\" and an occasional turn of the sentence, which told the listener that her English was an acquired language. \"I am glad he is not here,\" she said slowly. \"I do not want him to have pain.\" \"But perhaps, Mrs. Denison, you will be much better in a day or two, and able to welcome him when he comes back.\" \"No, I shall not be here when he comes back, and it is just as it should be. I asked him to turn round as he left the garden, and I could see him, oh, so well! He looked kind and so beautiful, and he waved to me his hand. Now he will come back, and he will be sad. He did not want to leave me, but the governor sent for him. He will be sad, and he will remember that I loved him, and some day he will be glad again.\" She smiled into the troubled face near her. The girl stroked the thick dark hair lovingly. \"Don't,\" she implored; \"it hurts me. You are better to-night, and the children are coming in.\" Mrs. Denison closed her eyes, and with her left hand she covered her face. \"No, not the children,\" she whispered, \"not my darlings. I cannot bear it. I must see them no more.\" She pressed her companion's hand with a sudden close pressure. \"But you will help them, Alice; you will make them English like you--like him. We will not pretend to-night; it is not long that I shall speak to you. I ask you to promise me to help them to be English.\" \"Dear,\" the girl urged, \"they are such a delicious mixture of England and New Zealand--prettier, sweeter than any mere English child could ever be. They are enchanting.\" But into the dying woman's eyes leaped an eager flame. \"They must all be English, no Maori!\" she cried. A violent fit of coughing interrupted her, and when the paroxysm was over she was too exhausted to speak. The English nurse, Mrs. Bentley, an elderly Yorkshire woman, who had been with Mrs. Denison since her first baby came six years ago, and who had, in fact, been Horace Denison's own nurse-maid, came in and sent the agitated girl into the garden. \"For you haven't had a breath of fresh air to-day,\" she said. At the door Alice turned. The large eyes were resting upon her with an intent and solemn regard, in which lay a message. \"What was it?\" she thought, as she passed through the wide hall sweet with flowers. \"She wanted to say something; I am sure she did. To-morrow I will ask her.\" But before the morrow came she knew. Mrs. Dennison had said _good-bye_. The funeral was over. Mr. Denison, who had looked unaccountably ill and weary for months, had been sent home by Mr. Danby for at least a year's change and rest, and the doctor's young sister had yielded to various pressure, and promised to stay with the children until he returned. There was every reason for it. She had loved and been loved by the gentle Maori mother; she delighted in the dark beauty and sweetness of the children. And they, on their side, clung to her as to an adorable fairy relative, dowered with love and the fruits of love--tales and new games and tender ways. Best reason of all, in a sense, Mrs. Bentley, that kind autocrat, entreated her to stay, \"as the happiest thing for the children, and to please that poor lamb we laid yonder, who fair longed that you should! She was mightily taken up with you, Miss Danby, and you've your brother and his wife near, so that you won't be lonesome, and if there's aught I can do to make you comfortable, you've only to speak, miss.\" As for Mr. Denison, he was pathetically grateful and relieved when Alice promised to remain. After the evening romp and the last good-night, when the two elder children, Ben and Marie, called after her mother, Maritana, had given her their last injunctions to be sure and come for them \"her very own self\" on her way down to breakfast in the morning, she usually rode down between the cabbage-trees, down by the old rata, fired last autumn, away through the grasslands to the doctor's house, a few miles nearer Rochester; or he and his wife would ride out to chat with her. But there were many evenings when she preferred the quiet of the airy house and the garden. The colonial life was new to her, everything had its charm, and in the colonies there is always a letter to write to those at home--the mail-bag is never satisfied. On such evenings it was her custom to cross the meadow to the copse of feathery trees beyond, where, sung to by the brook and the Tui, the children's mother slept. And from the high presence of the Mountain Beautiful there fell a dew of peace. She would often ask Mrs. Bentley to sit with her until bedtime, and revel in the shrewd north-country woman's experiences, and her impressions of the new land to which love had brought her. Both women grew to have a sincere and trustful affection for each other, and one night, seven or eight months after Mrs. Denison's death, Mrs. Bentley told a story which explained what had frequently puzzled Alice--the patient sorrow in Mrs. Denison's eyes, and Mr. Denison's harassed and dejected manner. \"But for your goodness to the children,\" said the old woman, \"and the way that precious baby takes to you, I don't think I should be willing to say what I am going to do, miss. Though my dear mistress wished it, and said, the very last night, 'You must tell her all about it, some day, Nana,'--and I promised, to quiet her,--I don't think I could bring myself to it if I hadn't lived with you and known you.\" And then the good nurse told her strange and moving tale. She described how her master had come out young and careless-hearted to New Zealand in the service of the government, and how scandalised and angry his father and mother, the old Tory squire and his wife, had been to receive from him, after a year or two, letters brimming with a boyish love for his \"beautiful Maori princess,\" whom he described as having \"the sweetest heart and the loveliest eyes in the world.\" It gave them little comfort to hear that her father was one of the wealthiest Maoris in the island, and that, though but half civilised himself, he had had his daughter well educated in the \"bishop's\" and other English schools. To them she was a savage. There was no threat of disinheritance, for there was nothing for him to inherit. There was little money, and the estate was entailed on the elder brother. But all that could be done to intimidate him was done, and in vain. Then silence fell between the parents and the son. But one spring day came the news of a grandson, called Benjamin after his grandfather, and an urgent letter from their boy himself, enclosing a prettily and humbly worded note from the new strange daughter, begging for an English nurse. She told them that she had now no father and no mother, for they had died before the baby came, and if she might love her husband's parents a little she would be glad. \"My lady read the letters to me herself,\" Mrs. Bentley said; \"I'd taken the housekeeper's place a bit before, and she asked me to find her a sensible young woman. Well, I tried, but there wasn't a girl in the place that was fit to nurse Master Horace's child. And the end of it was, I came myself, for Master Horace had been like my own when he was a little lad. My lady pretended to be vexed with me, but the day I sailed she thanked me in words I never thought to hear from her, for she was a bit proud always.\" The faithful servant's voice trembled. She leaned back in her chair, and forgot for the moment the new house and the new duties. She was back again in the old nursery with the fair-haired child playing about her knees. But Alice's face recalled her, and she continued the story. She had, she said, dreaded the meeting with her new mistress, and was prepared to find her \"a sort of a heathen woman, who'd pull down Master Horace till he couldn't call himself a gentleman.\" But when she saw the graceful creature who received her with gentle words and gestures of kindliness, and when she found her young master not only content, but happy, and when she took in her arms the laughing healthy baby, she felt--though she regretted its dark eyes and hair--more at home than she could have believed possible. The nurseries were so large and comfortable, and so much consideration was shown to her, that she confessed, \"I should have been more ungrateful than a cat if I hadn't settled comfortable.\" Then came nearly five happy years, during which time her young mistress had found a warm and secure place in the good Yorkshire heart. \"She was that loving and that kind that Dick Burdas, the groom, used to say that he believed she was an angel as had took up with them dark folks, to show 'em what an angel was like.\" Mrs. Bentley went on: \"She wasn't always quite happy, and I wondered what brought the shadow into her face, and why she would at times sigh that deep that I could have cried. After a bit I knew what it was. It was the Maori in her. She told me one night that she was a wicked woman, and ought never to have married Master Horace, for she got tired sometimes of the English house and its ways, and longed for her father's _whare_; (that's a native hut, miss). She grieved something awful one day when she had been to see old Tim, the Maori who lives behind the stables. She called herself a bad and ungrateful woman, and thought there must be some evil spirit in her tempting her into the old ways, because, when she saw Tim eating, and you know what bad stuff they eat, she had fair longed to join him. She gave me a fright I didn't get over for nigh a week. She leaned her bonny head against my knee, and I stroked her cheek and hummed some silly nursery tune,--for she was all of a tremble and like a child,--and she fell asleep just where she was.\" \"Poor thing!\" said Alice, softly. \"Eh, but it's what's coming that upsets me, ma'am. Eh, what suffering for my pretty lamb, and her that wouldn't have hurt a worm! Baby would be about six months old when she came in one day with him in her arms, and they _were_ a picture. His little hand was fast in her hair. She always walked as if she'd wheels on her feet, that gliding and graceful. She had on a sort of sheeny yellow silk, and her cheeks were like them damask roses at home, and her eyes fair shone like stars. 'Isn't he a beauty, Nana?' she asked me. 'If only he had blue eyes, and that hair of gold like my husband's, and not these ugly eyes of mine!' And as she spoke she sighed as I dreaded to hear. Then she told me to help her to unpack her new dress from Paris, which she was to wear at the Rochester races the next day. Master Horace always chose her dresses, and he was right proud of her in them. And next morning he came into the nursery with her, and she was all in pale red, and that beautiful! 'Isn't she scrumptious, Nana?' he said, in his boyish way. 'Don't spoil her dress, children. How like her Marie grows!' Those two little ones they had got her on her knees on the ground, and were hugging her as if they couldn't let her go. But when he said that, she got up very still and white. \"'I am sorry,' she said; 'they must never be like me.' \"'They can't be any one better, can they, baby?' he answered her, and he tossed the child nearly up to the ceiling. But he looked worried as he went out. I saw them drive away, and they looked happy enough. And oh, miss, I saw them come back. We were in the porch, me and the children. Master Horace lifted her down, and I heard him say, 'Never mind, Marie.' But she never looked his way nor ours; she walked straight in and upstairs to her room, past my bonny darling with his arm stretched out to her, and past Miss Marie, who was jumping up and down, and shouting 'Muvver'; and I heard her door shut. Then Master Horace took baby from me. \"'Go up to her,' he said, and I could scarce hear him. His face was all drawn like, but I felt that silly and stupid that I could say nothing, and just went upstairs.\" Mrs. Bentley put her knitting down, and throwing her apron over her head sobbed aloud. \"O nurse, what was it?\" cried Alice, and the colour left her cheeks. \"Do tell me. I am so sorry for them. What was it?\" It was several minutes before the good woman could recover herself; then she began: \"She told me, and Dick Burdas he told me, and it was like this. When they got to the race-course,--it was the first races they'd had in Rochester,--all the gentry was there, and those that knew her always made a deal of her, she had such half-shy, winning ways. And she seemed very bright, Dick said, talking with the governor's lady, who is full of fun and sparkle. The carriages were all together, and Major Beaumont, a kind old gentleman who's always been a good friend to Master Horace, would have them in his carriage for luncheon, or whatever it was. Dick says he was thinking that she was the prettiest lady there, when his eye was caught by two or three parties of Maoris setting themselves right in front of the carriages. There were four or five in each lot, and they were mostly old. They got out their sharks' flesh and that bad corn they eat, and began to make their meal of them. Near Mrs. Denison there was one old man with a better sort of face, and Dick heard her say to master, 'Isn't he like my father?' What Master Horace answered he didn't hear; he says he never saw anything like her face, so sad and wild, and working for all the world as if something were fighting her within. Then all in a minute she ran out and slipped down in her beautiful dress close by the old Maori in his dirty rags, and was rubbing her face against his, as them folks do when they meet. She had just taken a mouthful of the raw fish when Master Horace missed her. He hadn't noticed her slip away. But in a moment he seemed to understand what it meant. He saw the Maori come out strong in her face, and he knew the Maori had got the better of everything, husband and friends and all. He gave a little cry, and in a minute he had her on her feet and was bringing her back to the carriage. Some folks thought Dick Burdas a rough hard man, and I know he was a shocker of a lad (he was fra Whitby), but that night he cried like a baby when he tell 't me,\" and Mrs. Bentley fell for a moment into the dialect of her youth. \"He said,\" she continued, \"that she looked like a poor stricken thing condemned, and let herself be led back as submissive as a child, and Master Horace's face was like the dead. He didn't think any one but the major and Dr. Danby saw her go, all was done in a minute. But it was done, and some few had seen, and it got out, and things were said that wasn't true. Not the doctor! No, miss, you needn't tell me that; he's told none, that I'll warrant. He's faithful and he's close.\" \"O Mrs. Bentley, how dreadful for her, how dreadful!\" and the girl went down on her knees by the old woman, her tears flowing fast. \"That's it, miss, you understand. I feel like that. It was bad enough for Master Horace with the future before him, and his children to think of, but for her it was desperate cruel. Eh, ma'am, what she went through! She loved more than you'd have thought us poor human beings could. And, after all, the nature was in her; she didn't put it there. I've had a deal to do to keep down sinful thoughts since then; there's a lot of things that's wrong in this world, ma'am.\" \"What did she do?\" Alice whispered. \"She! She was for going away and leaving everything; she felt herself the worst woman in the world. It was only by begging and praying of her on my knees that I got her to stay in the house that night, for she was so far English, and had such a fancy, that she saw everything blacker than any Englishwoman would, even the partick'lerest. Afterward Master Horace was that good and gentle, and she loved him so much, that he persuaded her to say nothing more about it, and to try to live as if it hadn't been. And so she seemed to do, outward like, to other people. But it wasn't ever the same again. Something had broken in them both; with him it was his trust and his pride, but in her it was her heart.\" \"But the children--surely they comforted her.\" \"Eh, miss, that was the worst. Poor lamb, poor lamb! Never after that day, though they were more to her nor children ever were to a mother before, would she have them with her. Just a morning and a good-night kiss, and a quarter of an hour at most, and I must take them away. She watched them play in the garden from her window or the little hill there, and when they were asleep she would sit by them for hours, saying how bonny they were and how good they were growing. And she looked after their clothes and their food and every little toy and pleasure, but never came in for a romp and a chat any more.\" \"Dear, brave heart!\" murmured the girl. \"Yes, ma'am, you feel for her, I know. She was fair terrified of them turning Maori and shaming their father. That was it. You didn't notice? No; after you came she was too ill to bear them about, and it seemed natural, I dare say. The Maoris are a fearful delicate set of folks. A bad cold takes them off into consumption directly. And with her there was the sorrow as well as the cold. It was wonderful that she lived so long.\" Alice threw her arms round Mrs. Bentley's neck. \"O nurse, it is all so dreadful and sad. Couldn't we have somehow kept her with us and made her happy?\" The old woman held her close. \"Nay, my dear bairn, never after that happened. It, or worse, might have come again. It's something stronger in them than we know; it's the very blood, I'm thinking. But she's gone to be the angel that Dick always said she was.\" Alice looked away over the starlit garden to where the plumy trees stirred in the night wind. \"No,\" she said, fervently, \"not 'gone to be,' nurse dear; she was an angel always. Dick was right.\" KING BILLY OF BALLARAT, By Morley Roberts King Billy was given to strolling up and down the streets of Ballarat when that eviscerated city was merely in process of disembowelment, before alluvial mining gave way to quartz-crushing, when the individual had a chance, if a very vague one, of sudden and delightful fortune. The Ballarat blacks were a scaly lot, to talk of them like ill-fed hogs, as men were wont to do. They dwined and dwindled, as natives will before the resources of civilisation: the bloodthirsty ones got killed out; the rumthirsty ones died out; the wild corroboree was reduced to a poverty-stricken imitation of its former glory. King Billy's authority grew less with the increase of his clothes. The brass plate with his name on it was about the last relic of his precarious power, and was chiefly valued as a means of notifying the public generally that they might stand drinks to a monarch if they saw fit and were not too humble. He was not haughty, and never presumed on his plate, as parvenus will. He came of an ancient stock, and could afford to condescend, even if he could not afford to pay for drinks. He was very kind to children,--white children, of course,--and was hale-fellow-well-met with many of them. He was particularly fond of Annie Colborn, whose father was a magistrate and a gold commissioner, and a person of very great importance. Whether or not King Billy was wise in his generation, and out of the unwritten Scriptures of the somber bush had culled a maxim inculcating the wisdom of making friends of the sons of Mammon, I cannot say, but he was always good to Annie. For my own part, I do not believe the simple-hearted old king had any such notion inside his thick antipodean skull. He was good because he was not bad, which is the very best morality after all, and a great advance on much we hear of. And, besides, he was sometimes hungry, and Mr. Colborn's Chinese cook was very haughty, and not to be approached except through an intermediary. And who so capable of conciliating Wong as Annie? Wong would make her cakes even when his pigtail hung despondently from his aching head after an opium debauch, and his cheeks were shining with anything but gladness; for if you get drunk very often on opium you shine. Old Billy was mostly to be found where there was a chance of a drink; but if the fountains were dried up, or he had been insulted by some democratic, revolutionary, king-hating miner knocking his high hat down over his eyes, he usually went up to Mr. Colborn's place, and sat on the fence, or on a log outside the gate. So he was often very melancholy when Annie came out. One day his hat was very, very badly bulged indeed. \"Your hat is very bad to-day, King Billy,\" said six-year-old Annie, as she stood in front of him critically, with her head on one side. Without knowing it, the child had come to look upon the state of the poor king's hat as emblematical of his state of mind. When it shut up like a closed concertina his barometer was low. \"Yes, missy,\" said the king; \"white man knock 'um over eyes, and\"--with a rub down his face--\"skin 'um nose.\" She inspected his nose carefully--though from a certain distance, because her own nose was very good, both inside and out, and she knew the king never got washed unless it rained when he was very drunk. And this was the end of summer. It had not rained since November. \"There is not very much skin off,\" said Annie. \"You had better wash it.\" The king made a wry face and changed the conversation. \"You got 'um hat, Missy Annie? One hat baal brokum, allasame white fellow hat. Bad hat, King Billy bad; black fellow, white fellow laugh.\" He peered into his hat, and, trying to straighten it out, put his fist through the side. Poor Billy looked as if he could cry. \"You stop a minute,\" said Annie, and, flying indoors, she brought out a very good high hat indeed. \"Budgeree!\" thought the king, that was a good hat. He could go down the streets like a king indeed, able to hold up his head with any rich man in Ballarat. He tried it on, and though it was much too big, he knew it shone. And the glory of a hat is in its shining as much as its shape; even a black fellow knows that. But that hat very nearly led to serious trouble. For one thing, Mr. Colborn missed it; and never thinking Annie had given it away, when he saw the king sitting on the fence decorated with it, he stopped and interviewed him. \"Where did you get that hat, you old thief?\" asked the magistrate, without any politeness to him who ruled the land before white men broke into the country. Some in authority are polite to those they dispossess; the Prussians, for instance, to the miserable King Billys who strut about the empire. But the Anglo-Saxon only respects himself, and even that to a limited extent, in new conquests. The question troubled King Billy greatly. He did not know that Mr. Colborn would as soon have thought of murdering Annie as of bullying her; so he lied promptly: \"Me buy 'um, Mistah Cobon!\" Mr. Colborn took it off of his head, and saw that it was his, as he had thought. What he would have said I do not know, for just then he heard a voice behind him: \"Papa, it is my fault; I gave it to King Billy.\" Colborn turned round and took her up, letting fall the hat as he did so. Billy made a jump, picked it up, and, in his agitation, brushed it carefully the wrong way. \"My dear, if you gave it to him it's all right. But why didn't the old fool tell me?\" \"He's not an old fool, papa, and you must not say so. He's a good man, and I think he thought you would be angry with me. Didn't you, King Billy?\" And the king, with a smile of conscious rectitude, admitted it was so. Mr. Colborn gave him sixpence; and he gave Annie a great many kisses, declaring, with uncommon thoughtlessness, that whatever she did was right, and that she could give the king all his house, and Australia to boot. Whereon King Billy smiled a smile that was portentous, and showed his teeth to the uttermost recesses of his ample mouth. Looking down, he surveyed the rest of his clothes, which in parts resembled the child's definition of a net as a lot of holes tied together with string, and, looking up, he inspected Mr. Colborn as if estimating the resources of his wardrobe. But being urgently smitten with the necessity of getting rid of his sixpence, he shambled off into the town. Other matters might wait; that admitted of no delay. The mind of King Billy was not a big mind; it would no more have taken in an abstract idea than his _gunyah_ would have accommodated a grand piano. He was as simple as sunlight, and to resolve his intellect into seven colours would want the most ingenious spectroscope. But he could make an inference from a positive fact, and, having made it, he did not allow more remote deductions to trouble his legitimate conclusion. He ceased to fear Mr. Colborn, and began to look upon the magistrate's property as if it were at least half his own. So he got very drunk on the hospitality of a new chum miner who had been successful, and presently, presuming on his new possessions, got into a fight with his entertainer and a disrespectful subking of his own blacks, and was reduced to worse rags than ever. Next morning he sat outside the magistrate's house, on the lowest log he could find, and when Mr. Colborn came out he tackled him with the air of a subject king demanding redress of his suzerain. \"Well, Billy, what is it?\" asked the suzerain. \"You belong gublement?\" said Billy the king, with a question, an implied doubt, and a great complaint in his voice. Colborn laughed. \"Why, yes, Billy; I belong to the government, I suppose.\" \"Then,\" said Billy, \"what you say to white fellow make 'um black fellow drunk, knock 'um all about? Call you that gublement?\" And he showed his kingly robe, which had once been a frock-coat, with great disgust. However, he met with no favour, and was told that he should not get drunk--that it served him right; with which magisterial decision Colborn got on his horse and rode off to the flat. The king sat down sadly and considered thickly in his slow brain. Annie did not come out, and he knew better than to ask for her, for Mr. Colborn's niece, who kept house for him, was but newly come from home, and thought all black fellows congenital murderers, which indeed they are in some parts of the north. So Billy sat and waited, for he wanted a new coat. How could he be respected in one whose natural divisions were unnaturally extended to the very neck? It was obviously necessary to get a new garment at once, and the best chance of a good one lay in little Annie's kindness. But in order to obviate the slightest chance of his girl patron's refusing, he must bring her some offering. He went off into the bush at the back of the town, and, coming to where three or four black fellows were camped, he sat down and talked with them. In spite of the heat, a wretched old gin, muffled up in her one garment, a ragged blanket, held her hands over the few burning sticks which represent an Australian native's idea of a fire. Presently King Billy rose, and, taking a tomahawk, went farther into the bush. He looked about, and at last came to a tree, which he climbed native fashion, first discarding his clothes. When near the first big branches he came to a hole, and, putting in his hand, he extracted a lively young possum by the tail. Next morning he was sitting on the Colborns' fence as usual. At his feet was a little box with two or three slats nailed roughly across it. Inside was the possum. King Billy wondered what kind of a coat he could get. He liked a frock-coat; there was something majestic about it, something fine and ample. Common morning coats would not do; no one would insult a king by offering him tweed; even little Annie knew better than that, especially if he gave her a live possum he had caught himself. And when Annie did come out, she was in the seventh heaven of delight with the possum, and ready to bestow anything in the world on King Billy. \"You give poor Billy one fellow coat, missy, and he go down along street like a king.\" Annie flew into the house and seized the first garment she laid her little hands on. It was her father's dress-coat. She rolled it up, and, running out, thrust it excitedly into the king's black paw. As he went off, she carried the possum indoors, and was deliriously happy for hours. King Billy hurried into the bush till he came to a water-hole, and, stripping off his rags, he held up the coat. His jaw fell; there was a remarkable exiguity about the coat which was inexplicable. He had never observed such in his life. He put it on, and, bending over the surface of the still pool, took a good look at the general effect. It was not bad from some points of view, but Billy had his doubts as to whether he would be received with the respect due to his title if he went into Ballarat clothed thus. He tried to button it, but discovered that, if it had ever been intended for buttoning, he could not get it to meet across his chest. He picked up his discarded frock-coat, which was held together by the collar; then he felt the stuff of which the dress-coat was made, and the material pleased him. \"Oh, why,\" asked Billy, \"had it not been made with front tails?\" He saw at last that this coat and his high hat alone were insufficient for civilisation. For full dress in a corroboree it might do. Unconsciously, he was so wrought upon by the purpose for which the coat had been built that he determined to reserve it for parties in the seclusion of the bush, where any merriment could be rightly checked by a crack from his waddy. He planted it carefully in a hollow log, and, having inserted himself with as much care into his discarded rags, he wondered off into the town. He got very intoxicated that night, and determined to have a party all by himself. Now it may seem very annoying, and I confess I find it so myself; but, having got so far, I don't see my way to tell the rest, even if Annie Colborn told me the story herself. For after her father's death she married a man who had a small sheep-station and a hotel not forty miles from Carabobla, in New South Wales. I stayed there a couple of days when I was going north to the Murrumbidgee. But though she told me, I cannot tell it again, at least not in bold, bad print. Still, it will occur to most that a man of King Billy's sweet and innocent disposition might very likely create a sensation, when his natural discretion was drowned in bad whisky, if he ended his solitary corroboree in the moonlight by going up to Colborn's house in order to deliver a speech of gratitude through the French windows. So Colborn and the king had a corroboree all to themselves in the open space before the house, while the gold commissioner's guests roared with laughter to find out where the missing dress-coat was. Next day King Billy resumed the split frock-coat. "},{"title":"THY HEART'S DESIRE","author":"Netta Syrett","challenge":"The tents were pitched in the little plain surrounded by hills. Right and left there were stretches of tender, vivid green where the young corn was springing; farther still, on either hand, the plain was yellow with mustard-flower; but in the immediate foreground it was bare and stony. A few thorny bushes pushed their straggling way through the dry soil, ineffectively as far as the grace of the landscape was concerned, for they merely served to emphasise the barren aridness of the land that stretched before the tents, sloping gradually to the distant hills. The hills were uninteresting enough in themselves; they had no grandeur of outline, no picturesqueness even, though at morning and evening the sun, like a great magician, clothed them with beauty at a touch. They had begun to change, to soften, to blush rose red in the evening light, when a woman came to the entrance of the largest of the tents and looked toward them. She leaned against the support on one side of the canvas flap, and, putting back her head, rested that, too, against it, while her eyes wandered over the plain and over the distant hills. She was bareheaded, for the covering of the tent projected a few feet to form an awning overhead. The gentle breeze which had risen with sundown stirred the soft brown tendrils of hair on her temples, and fluttered her pink cotton gown a little. She stood very still, with her arms hanging and her hands clasped loosely in front of her. There was about her whole attitude an air of studied quiet which in some vague fashion the slight clasp of her hands accentuated. Her face, with its tightly, almost rigidly closed lips, would have been quite in keeping with the impression of conscious calm which her entire presence suggested, had it not been that when she raised her eyes a strange contradiction to this idea was afforded. They were large gray eyes, unusually bright and rather startling in effect, for they seemed the only live thing about her. Gleaming from her still, set face, there was something almost alarming in their brilliancy. They softened with a sudden glow of pleasure as they rested on the translucent green of the wheat-fields under the broad generous sunlight, and then wandered to where the pure vivid yellow of the mustard-flower spread in waves to the base of the hills, now mystically veiled in radiance. She stood motionless, watching their melting, elusive changes from palpitating rose to the transparent purple of amethyst. The stillness of evening was broken by the monotonous, not unmusical creaking of a Persian wheel at some little distance to the left of the tent. The well stood in a little grove of trees; between their branches she could see, when she turned her head, the coloured saris of the village women, where they stood in groups chattering as they drew the water, and the little naked brown babies that toddled beside them or sprawled on the hard ground beneath the trees. From the village of flat-roofed mud houses under the low hill at the back of the tents, other women were crossing the plain toward the well, their terra-cotta water-jars poised easily on their heads, casting long shadows on the sun-baked ground as they came. Presently, in the distance, from the direction of the sunlit hills opposite a little group of men came into sight. Far off, the mustard-coloured jackets and the red turbans of the orderlies made vivid splashes of colour on the dull plain. As they came nearer, the guns slung across their shoulders, the cases of mathematical instruments, the hammers, and other heavy baggage they carried for the sahib, became visible. A little in front, at walking pace rode the sahib himself, making notes as he came in a book he held before him. The girl at the tent entrance watched the advance of the little company indifferently, it seemed; except for a slight tightening of the muscles about her mouth, her face remained unchanged. While he was still some little distance away, the man with the notebook raised his head and smiled awkwardly as he saw her standing there. Awkwardness, perhaps, best describes the whole man. He was badly put together, loose-jointed, ungainly. The fact that he was tall profited him nothing, for it merely emphasised the extreme ungracefulness of his figure. His long pale face was made paler by the shock of coarse, tow-coloured hair; his eyes, even, looked colourless, though they were certainly the least uninteresting feature of his face, for they were not devoid of expression. He had a way of slouching when he moved that singularly intensified the general uncouthness of his appearance. \"Are you very tired?\" asked his wife, gently, when he had dismounted close to the tent. The question would have been an unnecessary one had it been put to her instead of to her husband, for her voice had that peculiar flat toneless sound for which extreme weariness is answerable. \"Well, no, my dear, not very,\" he replied, drawling out the words with an exasperating air of delivering a final verdict, after deep reflection on the subject. The girl glanced once more at the fading colours on the hills. \"Come in and rest,\" she said, moving aside a little to let him pass. She stood lingering a moment after he had entered the tent, as though unwilling to leave the outer air; and before she turned to follow him she drew a deep breath, and her hand went for one swift second to her throat as though she felt stifled. Later on that evening she sat in her tent, sewing by the light of the lamp that stood on her little table. Opposite to her, her husband stretched his ungainly length in a deck-chair, and turned over a pile of official notes. Every now and then her eyes wandered from the gay silks of the table-cover she was embroidering to the canvas walls which bounded the narrow space into which their few household goods were crowded. Outside there was a deep hush. The silence of the vast empty plain seemed to work its way slowly, steadily in toward the little patch of light set in its midst. The girl felt it in every nerve; it was as though some soft-footed, noiseless, shapeless creature, whose presence she only dimly divined, was approaching nearer--_nearer_. The heavy outer stillness was in some way made more terrifying by the rustle of the papers her husband was reading, by the creaking of his chair as he moved, and by the little fidgeting grunts and half-exclamations which from time to time broke from him. His wife's hand shook at every unintelligible mutter from him, and the slight habitual contraction between her eyes deepened. All at once she threw her work down on to the table. \"For heaven's sake--_please_, John, _talk_!\" she cried. Her eyes, for the moment's space in which they met the startled ones of her husband, had a wild, hunted look, but it was gone almost before his slow brain had time to note that it had been there--and was vaguely disturbing. She laughed a little unsteadily. \"Did I startle you? I'm sorry. I\"--she laughed again--\"I believe I'm a little nervous. When one is all day alone--\" She paused without finishing the sentence. The man's face changed suddenly. A wave of tenderness swept over it, and at the same time an expression of half-incredulous delight shone in his pale eyes. \"Poor little girl, are you really lonely?\" he said. Even the real feeling in his tone failed to rob his voice of its peculiarly irritating grating quality. He rose awkwardly, and moved to his wife's side. Involuntarily she shrank a little, and the hand which he had stretched out to touch her hair sank to his side. She recovered herself immediately, and turned her face up to his, though she did not raise her eyes; but he did not kiss her. Instead, he stood in an embarrassed fashion a moment by her side, and then went back to his seat. There was silence again for some time. The man lay back in his chair, gazing at his big, clumsy shoes as though he hoped for some inspiration from that quarter, while his wife worked with nervous haste. \"Don't let me keep you from reading, John,\" she said, and her voice had regained its usual gentle tone. \"No, my dear; I'm just thinking of something to say to you, but I don't seem--\" She smiled a little. In spite of herself, her lip curled faintly. \"Don't worry about it; it was stupid of me to expect it. I mean--\" she added, hastily, immediately repenting the sarcasm. She glanced furtively at him, but his face was quite unmoved; evidently he had not noticed it, and she smiled faintly again. \"O Kathie, I knew there was _something_ I'd forgotten to tell you, my dear; there's a man coming down here. I don't know whether--\" She looked up sharply. \"A man coming _here_? What for?\" she interrupted, breathlessly. \"Sent to help me about this oil-boring business, my dear.\" He had lighted his pipe, and was smoking placidly, taking long whiffs between his words. \"Well?\" impatiently questioned his wife, fixing her bright eyes on his face. \"Well--that's all, my dear.\" She checked an exclamation. \"But don't you know anything about him--his name? where he comes from? what he is like?\" She was leaning forward against the table, her needle, with a long end of yellow silk drawn half-way through her work, held in her upraised hand, her whole attitude one of quivering excitement and expectancy. The man took his pipe from his mouth deliberately, with a look of slow wonder. \"Why, Kathie, you seem quite anxious. I didn't know you'd be so interested, my dear. Well,\"--another long pull at his pipe,--\"his name's Brook--_Brookfield_, I think.\" He paused again. \"This pipe doesn't draw well a bit; there's something wrong with it, I shouldn't wonder,\" he added, taking it out and examining the bowl as though struck with the brilliance of the idea. The woman opposite put down her work and clinched her hands under the table. \"Go on, John,\" she said, presently, in a tense, vibrating voice; \"his name is Brookfield. Well, where does he come from?\" \"Straight from home, my dear, I believe.\" He fumbled in his pocket, and after some time extricated a pencil, with which he began to poke the tobacco in the bowl in an ineffectual aimless fashion, becoming completely engrossed in the occupation apparently. There was another long pause. The woman went on working, or feigning to work, for her hands were trembling a good deal. After some moments she raised her head again. \"John, will you mind attending to me one moment, and answering these questions as quickly as you can?\" The emphasis on the last word was so faint as to be almost as imperceptible as the touch of exasperated contempt which she could not absolutely banish from her tone. Her husband, looking up, met her clear bright gaze, and reddened like a school-boy. \"Whereabouts '_from home_' does he come?\" she asked, in a studiedly gentle fashion. \"Well, from London, I think,\" he replied, almost briskly for him, though he stammered and tripped over the words. \"He's a university chap; I used to hear he was clever; I don't know about that, I'm sure; he used to chaff me, I remember, but--\" \"Chaff _you_? You have met him then?\" \"Yes, my dear,\"--he was fast relapsing into his slow drawl again,--\"that is, I went to school with him; but it's a long time ago. Brookfield--yes, that must be his name.\" She waited a moment; then, \"When is he coming?\" she inquired, abruptly. \"Let me see--to-day's--\" \"_Monday_;\" the word came swiftly between her set teeth. \"Ah, yes--Monday; well,\" reflectively, \"_next_ Monday, my dear.\" Mrs. Drayton rose, and began to pace softly the narrow passage between the table and the tent wall, her hands clasped loosely behind her. \"How long have you known this?\" she said, stopping abruptly. \"O John, you _needn't_ consider; it's quite a simple question. To-day? Yesterday?\" Her foot moved restlessly on the ground as she waited. \"I think it was the day before yesterday,\" he replied. \"Then why, in heaven's name, didn't you tell me before?\" she broke out, fiercely. \"My dear, it slipped my memory. If I'd thought you would be interested--\" \"Interested!\" She laughed shortly. \"It _is_ rather interesting to hear that after six months of this\"--she made a quick comprehensive gesture with her hand--\"one will have some one to speak to--some one. It is the hand of Providence; it comes just in time to save me from--\" She checked herself abruptly. He sat staring up at her stupidly, without a word. \"It's all right, John,\" she said, with a quick change of tone, gathering up her work quietly as she spoke. \"I'm not mad--yet. You--you must get used to these little outbreaks,\" she added, after a moment, smiling faintly; \"and, to do me justice, I don't _often_ trouble you with them, do I? I'm just a little tired, or it's the heat or--something. No--don't touch me!\" she cried, shrinking back; for he had risen slowly and was coming toward her. She had lost command over her voice, and the shrill note of horror in it was unmistakable. The man heard it, and shrank in his turn. \"I'm so sorry, John,\" she murmured, raising her great bright eyes to his face. They had not lost their goaded expression, though they were full of tears. \"I'm awfully sorry; but I'm just nervous and stupid, and I can't bear _any one_ to touch me when I'm nervous.\" \"Here's Broomhurst, my dear! I made a mistake in his name after all, I find. I told you _Brookfield_, I believe, didn't I? Well, it isn't Brookfield, he says; it's Broomhurst.\" Mrs. Drayton had walked some little distance across the plain to meet and welcome the expected guest. She stood quietly waiting while her husband stammered over his incoherent sentences, and then put out her hand. \"We are very glad to see you,\" she said, with a quick glance at the new-comer's face as she spoke. As they walked together toward the tent, after the first greetings, she felt his keen eyes upon her before he turned to her husband. \"I'm afraid Mrs. Drayton finds the climate trying?\" he asked. \"Perhaps she ought not to have come so far in this heat?\" \"Kathie is often pale. You _do_ look white to-day, my dear,\" he observed, turning anxiously toward his wife. \"Do I?\" she replied. The unsteadiness of her tone was hardly appreciable, but it was not lost on Broomhurst's quick ears. \"Oh, I don't think so. I _feel_ very well.\" \"I'll come and see if they've fixed you up all right,\" said Drayton, following his companion toward the new tent that had been pitched at some little distance from the large one. \"We shall see you at dinner then?\" Mrs. Drayton observed in reply to Broomhurst's smile as they parted. She entered the tent slowly, and, moving up to the table already laid for dinner, began to rearrange the things upon it in a purposeless, mechanical fashion. After a moment she sank down upon a seat opposite the open entrance, and put her hand to her head. \"What is the matter with me?\" she thought, wearily. \"All the week I've been looking forward to seeing this man--_any_ man, _any one_ to take off the edge of this.\" She shuddered. Even in thought she hesitated to analyse the feeling that possessed her. \"Well, he's here, and I think I feel _worse_.\" Her eyes travelled toward the hills she had been used to watch at this hour, and rested on them with a vague, unseeing gaze. \"Tired Kathie? A penny for your thoughts, my dear,\" said her husband, coming in presently to find her still sitting there. \"I'm thinking what a curious world this is, and what an ironical vein of humour the gods who look after it must possess,\" she replied, with a mirthless laugh, rising as she spoke. John looked puzzled. \"Funny my having known Broomhurst before, you mean?\" he said doubtfully. \"I was fishing down at Lynmouth this time last year,\" Broomhurst said at dinner. \"You know Lynmouth, Mrs. Drayton? Do you never imagine you hear the gurgling of the stream? I am tantalised already by the sound of it rushing through the beautiful green gloom of those woods--_aren't_ they lovely? And _I_ haven't been in this burnt-up spot as many hours as you've had months of it.\" She smiled a little. \"You must learn to possess your soul in patience,\" she said, and glanced inconsequently from Broomhurst to her husband, and then dropped her eyes and was silent a moment. John was obviously, and a little audibly, enjoying his dinner. He sat with his chair pushed close to the table, and his elbows awkwardly raised, swallowing his soup in gulps. He grasped his spoon tightly in his bony hand, so that its swollen joints stood out larger and uglier than ever, his wife thought. Her eyes wandered to Broomhurst's hands. They were well shaped, and, though not small, there was a look of refinement about them; he had a way of touching things delicately, a little lingeringly, she noticed. There was an air of distinction about his clear-cut, clean-shaven face, possibly intensified by contrast with Drayton's blurred features; and it was, perhaps, also by contrast with the gray cuffs that showed beneath John's ill-cut drab suit that the linen Broomhurst wore seemed to her particularly spotless. Broomhurst's thoughts, for his part, were a good deal occupied with his hostess. She was pretty, he thought, or perhaps it was that, with the wide, dry lonely plain as a setting, her fragile delicacy of appearance was invested with a certain flower-like charm. \"The silence here seems rather strange, rather appalling at first, when one is fresh from a town,\" he pursued, after a moment's pause; \"but I suppose you're used to it, eh, Drayton? How do _you_ find life here, Mrs. Drayton?\" he asked, a little curiously, turning to her as he spoke. She hesitated a second. \"Oh, much the same as I should find it anywhere else, I expect,\" she replied; \"after all, one carries the possibilities of a happy life about with one; don't you think so? The Garden of Eden wouldn't necessarily make my life any happier, or less happy, than a howling wilderness like this. It depends on one's self entirely.\" \"Given the right Adam and Eve, the desert blossoms like the rose, in fact,\" Broomhurst answered, lightly, with a smiling glance inclusive of husband and wife; \"you two don't feel as though you'd been driven out of Paradise, evidently.\" Drayton raised his eyes from his plate with a smile of total incomprehension. \"Great heavens! what an Adam to select!\" thought Broomhurst, involuntarily, as Mrs. Drayton rose rather suddenly from the table. \"I'll come and help with that packing-case,\" John said, rising, in his turn, lumberingly from his place; \"then we can have a smoke--eh! Kathie don't mind, if we sit near the entrance.\" The two men went out together, Broomhurst holding the lantern, for the moon had not yet risen. Mrs. Drayton followed them to the doorway, and, pushing the looped-up hanging farther aside, stepped out into the cool darkness. Her heart was beating quickly, and there was a great lump in her throat that frightened her as though she were choking. \"And I am his _wife_--I _belong_ to him!\" she cried, almost aloud. She pressed both her hands tightly against her breast, and set her teeth, fighting to keep down the rising flood that threatened to sweep away her composure. \"Oh, what a fool I am! What an hysterical fool of a woman I am!\" she whispered below her breath. She began to walk slowly up and down outside the tent, in the space illumined by the lamplight, as though striving to make her outwardly quiet movements react upon the inward tumult. In a little while she had conquered; she quietly entered the tent, drew a low chair to the entrance, and took up a book, just as footsteps became audible. A moment afterward Broomhurst emerged from the darkness into the circle of light outside, and Mrs. Drayton raised her eyes from the pages she was turning to greet him with a smile. \"Are your things all right?\" \"Oh, yes, more or less, thank you. I was a little concerned about a case of books, but it isn't much damaged fortunately. Perhaps I've some you would care to look at?\" \"The books will be a godsend,\" she returned, with a sudden brightening of the eyes; \"I was getting _desperate_--for books.\" \"What are you reading now?\" he asked, glancing at the volume that lay in her lap. \"It's a Browning. I carry it about a good deal. I think I like to have it with me, but I don't seem to read it much.\" \"Are you waiting for a suitable optimistic moment?\" Broomhurst inquired, smiling. \"Yes, now that you mention it, I think that must be why I am waiting,\" she replied, slowly. \"And it doesn't come--even in the Garden of Eden? Surely the serpent, pessimism, hasn't been insolent enough to draw you into conversation with him?\" he said, lightly. \"There has been no one to converse with at all--when John is away, I mean. I think I should have liked a little chat with the serpent immensely by way of a change,\" she replied, in the same tone. \"Ah, yes,\" Broomhurst said, with sudden seriousness; \"it must be unbearably dull for you alone here, with Drayton away all day.\" Mrs. Drayton's hand shook a little as she fluttered a page of her open book. \"I should think it quite natural you would be irritated beyond endurance to hear that all's right with the world, for instance, when you were sighing for the long day to pass,\" he continued. \"I don't mind the day so much; it's the evenings.\" She abruptly checked the swift words, and flushed painfully. \"I mean--I've grown stupidly nervous, I think--even when John is here. Oh, you have no idea of the awful _silence_ of this place at night,\" she added, rising hurriedly from her low seat, and moving closer to the doorway. \"It is so close, isn't it?\" she said, almost apologetically. There was silence for quite a minute. Broomhurst's quick eyes noted the silent momentary clinching of the hands that hung at her side, as she stood leaning against the support at the entrance. \"But how stupid of me to give you such a bad impression of the camp--the first evening, too!\" Mrs. Drayton exclaimed, presently; and her companion mentally commended the admirable composure of her voice. \"Probably you will never notice that it _is_ lonely at all,\" she continued; \"John likes it here. He is immensely interested in his work, you know. I hope _you_ are too. If you are interested it is all quite right. I think the climate tries me a little. I never used to be stupid--and nervous. Ah, here's John; he's been round to the kitchen tent, I suppose.\" \"Been looking after that fellow cleanin' my gun, my dear,\" John explained, shambling toward the deck-chair. Later Broomhurst stood at his own tent door. He looked up at the star-sown sky, and the heavy silence seemed to press upon him like an actual, physical burden. He took his cigar from between his lips presently, and looked at the glowing end reflectively before throwing it away. \"Considering that she has been alone with him here for six months, she has herself very well in hand--_very_ well in hand,\" he repeated. It was Sunday morning. John Drayton sat just inside the tent, presumably enjoying his pipe before the heat of the day. His eyes furtively followed his wife as she moved about near him, sometimes passing close to his chair in search of something she had mislaid. There was colour in her cheeks; her eyes, though preoccupied, were bright; there was a lightness and buoyancy in her step which she set to a little dancing air she was humming under her breath. After a moment or two the song ceased; she began to move slowly, sedately; and, as if chilled by a raw breath of air, the light faded from her eyes, which she presently turned toward her husband. \"Why do you look at me?\" she asked, suddenly. \"I don't know, my dear,\" he began slowly and laboriously, as was his wont. \"I was thinkin' how nice you looked--jest now--much better, you know; but somehow,\"--he was taking long whiffs at his pipe, as usual, between each word, while she stood patiently waiting for him to finish,--\"somehow, you alter so, my dear--you're quite pale again, all of a minute.\" She stood listening to him, noticing against her will the more than suspicion of cockney accent and the thick drawl with which the words were uttered. His eyes sought her face piteously. She noticed that too, and stood before him torn by conflicting emotions, pity and disgust struggling in a hand-to-hand fight within her. \"Mr. Broomhurst and I are going down by the well to sit; it's cooler there. Won't you come?\" she said at last, gently. He did not reply for a moment; then he turned his head aside, sharply for him. \"No, my dear, thank you; I'm comfortable enough here,\" he returned, huskily. She stood over him, hesitating a second; then moved abruptly to the table, from which she took a book. He had risen from his seat by the time she turned to go out, and he intercepted her timorously. \"Kathie, give me a kiss before you go,\" he whispered, hoarsely. \"I--I don't often bother you.\" She drew her breath in deeply as he put his arms clumsily about her; but she stood still, and he kissed her on the forehead, and touched the little wavy curls that strayed across it gently with his big, trembling fingers. When he released her, she moved at once impetuously to the open doorway. On the threshold she hesitated, paused a moment irresolutely, and then turned back. \"Shall I--does your pipe want filling, John?\" she asked, softly. \"No, thank you, my dear.\" \"Would you like me to stay, read to you, or anything?\" He looked up at her wistfully. \"N-no, thank you; I'm not much of a reader, you know, my dear--somehow.\" She hated herself for knowing that there would be a \"my dear,\" probably a \"somehow,\" in his reply, and despised herself for the sense of irritated impatience she felt by anticipation, even before the words were uttered. There was a moment's hesitating silence, broken by the sound of quick, firm footsteps without. Broomhurst paused at the entrance, and looked into the tent. \"Aren't you coming, Drayton?\" he asked, looking first at Drayton's wife and then swiftly putting in his name with a scarcely perceptible pause. \"Too lazy? But you, Mrs. Drayton?\" \"Yes, I'm coming,\" she said. They left the tent together, and walked some few steps in silence. Broomhurst shot a quick glance at his companion's face. \"Anything wrong?\" he asked, presently. Though the words were ordinary enough, the voice in which they were spoken was in some subtle fashion a different voice from that in which he had talked to her nearly two months ago, though it would have required a keen sense of nice shades in sound to have detected the change. Mrs. Drayton's sense of niceties in sound was particularly keen, but she answered quietly, \"Nothing, thank you.\" They did not speak again till the trees round the stone well were reached. Broomhurst arranged their seats comfortably beside it. \"Are we going to read or talk?\" he asked, looking up at her from his lower place. \"Well, we generally talk most when we arrange to read; so shall we agree to talk to-day for a change, by way of getting some reading done?\" she rejoined, smiling. \"_You_ begin.\" Broomhurst seemed in no hurry to avail himself of the permission; he was apparently engrossed in watching the flecks of sunshine on Mrs. Drayton's white dress. The whirring of insects, and the creaking of a Persian wheel somewhere in the neighbourhood, filtered through the hot silence. Mrs. Drayton laughed after a few minutes; there was a touch of embarrassment in the sound. \"The new plan doesn't answer. Suppose you read, as usual, and let me interrupt, also as usual, after the first two lines.\" He opened the book obediently, but turned the pages at random. She watched him for a moment, and then bent a little forward toward him. \"It is my turn now,\" she said, suddenly; \"is anything wrong?\" He raised his head, and their eyes met. There was a pause. \"I will be more honest than you,\" he returned; \"yes, there is.\" \"What?\" \"I've had orders to move on.\" She drew back, and her lips whitened, though she kept them steady. \"When do you go?\" \"On Wednesday.\" There was silence again; the man still kept his eyes on her face. The whirring of the insects and the creaking of the wheel had suddenly grown so strangely loud and insistent that it was in a half-dazed fashion she at length heard her name--\"_Kathleen!_\" \"Kathleen!\" he whispered again, hoarsely. She looked him full in the face, and once more their eyes met in a long, grave gaze. The man's face flushed, and he half rose from his seat with an impetuous movement; but Kathleen stopped him with a glance. \"Will you go and fetch my work? I left it in the tent,\" she said, speaking very clearly and distinctly; \"and then will you go on reading? I will find the place while you are gone.\" She took the book from his hand, and he rose and stood before her. There was a mute appeal in his silence, and she raised her head slowly. Her face was white to the lips, but she looked at him unflinchingly; and without a word he turned and left her. Mrs. Drayton was resting in the tent on Tuesday afternoon. With the help of cushions and some low chairs, she had improvised a couch, on which she lay quietly with her eyes closed. There was a tenseness, however, in her attitude which indicated that sleep was far from her. Her features seemed to have sharpened during the last few days, and there were hollows in her cheeks. She had been very ill for a long time, but all at once, with a sudden movement, she turned her head and buried her face in the cushions with a groan. Slipping from her place, she fell on her knees beside the couch, and put both hands before her mouth to force back the cry that she felt struggling to her lips. For some moments the wild effort she was making for outward calm, which even when she was alone was her first instinct, strained every nerve and blotted out sight and hearing, and it was not till the sound was very near that she was conscious of the ring of horse's hoofs on the plain. She raised her head sharply, with a thrill of fear, still kneeling, and listened. There was no mistake. The horseman was riding in hot haste, for the thud of the hoofs followed one another swiftly. As Mrs. Drayton listened her white face grew whiter, and she began to tremble. Putting out shaking hands, she raised herself by the arms of the folding-chair and stood upright. Nearer and nearer came the thunder of the approaching sound, mingled with startled exclamations and the noise of trampling feet from the direction of the kitchen tent. Slowly, mechanically almost, she dragged herself to the entrance, and stood clinging to the canvas there. By the time she had reached it Broomhurst had flung himself from the saddle, and had thrown the reins to one of the men. Mrs. Drayton stared at him with wide, bright eyes as he hastened toward her. \"I thought you--you are not--\" she began, and then her teeth began to chatter. \"I am so cold!\" she said, in a little, weak voice. Broomhurst took her hand and led her over the threshold back into the tent. \"Don't be so frightened,\" he implored; \"I came to tell you first. I thought it wouldn't frighten you so much as--Your--Drayton is--very ill. They are bringing him. I--\" He paused. She gazed at him a moment with parted lips; then she broke into a horrible, discordant laugh, and stood clinging to the back of a chair. Broomhurst started back. \"Do you understand what I mean?\" he whispered. \"Kathleen, for God's sake--_don't_--he is _dead_.\" He looked over his shoulder as he spoke, her shrill laughter ringing in his ears. The white glare and dazzle of the plain stretched before him, framed by the entrance to the tent; far off, against the horizon, there were moving black specks, which he knew to be the returning servants with their still burden. They were bringing John Drayton home. One afternoon, some months later, Broomhurst climbed the steep lane leading to the cliffs of a little English village by the sea. He had already been to the inn, and had been shown by the proprietress the house where Mrs. Drayton lodged. \"The lady was out, but the gentleman would likely find her if he went to the cliffs--down by the bay, or thereabouts,\" her landlady explained; and, obeying her directions, Broomhurst presently emerged from the shady woodland path on to the hillside overhanging the sea. He glanced eagerly round him, and then, with a sudden quickening of the heart, walked on over the springy heather to where she sat. She turned when the rustling his footsteps made through the bracken was near enough to arrest her attention, and looked up at him as he came. Then she rose slowly and stood waiting for him. He came up to her without a word, and seized both her hands, devouring her face with his eyes. Something he saw there repelled him. Slowly he let her hands fall, still looking at her silently. \"You are not glad to see me, and I have counted the hours,\" he said, at last, in a dull, toneless voice. Her lips quivered. \"Don't be angry with me--I can't help it--I'm not glad or sorry for anything now,\" she answered; and her voice matched his for grayness. They sat down together on a long flat stone half embedded in a wiry clump of whortleberries. Behind them the lonely hillsides rose, brilliant with yellow bracken and the purple of heather. Before them stretched the wide sea. It was a soft, gray day. Streaks of pale sunlight trembled at moments far out on the water. The tide was rising in the little bay above which they sat, and Broomhurst watched the lazy foam-edged waves slipping over the uncovered rocks toward the shore, then sliding back as though for very weariness they despaired of reaching it. The muffled, pulsing sound of the sea filled the silence. Broomhurst thought suddenly of hot Eastern sunshine, of the whir of insect wings on the still air, and the creaking of a wheel in the distance. He turned and looked at his companion. \"I have come thousands of miles to see you,\" he said; \"aren't you going to speak to me now I am here?\" \"Why did you come? I told you not to come,\" she answered, falteringly. \"I--\" she paused. \"And I replied that I should follow you--if you remember,\" he answered, still quietly. \"I came because I would not listen to what you said then, at that awful time. You didn't know _yourself_ what you said. No wonder! I have given you some months, and now I have come.\" There was silence between them. Broomhurst saw that she was crying; her tears fell fast on to her hands, that were clasped in her lap. Her face, he noticed, was thin and drawn. Very gently he put his arm round her shoulder and drew her nearer to him. She made no resistance; it seemed that she did not notice the movement; and his arm dropped at his side. \"You asked me why I had come. You think it possible that three months can change one very thoroughly, then?\" he said, in a cold voice. \"I not only think it possible; I have proved it,\" she replied, wearily. He turned round and faced her. \"You _did_ love me, Kathleen!\" he asserted. \"You never said so in words, but I know it,\" he added, fiercely. \"Yes, I did.\" \"And--you mean that you don't now?\" Her voice was very tired. \"Yes; I can't help it,\" she answered; \"it has gone--utterly.\" The gray sea slowly lapped the rocks. Overhead the sharp scream of a gull cut through the stillness. It was broken again, a moment afterward, by a short hard laugh from the man. \"Don't!\" she whispered, and laid a hand swiftly on his arm. \"Do you think it isn't worse for me? I wish to God I _did_ love you!\" she cried, passionately. \"Perhaps it would make me forget that, to all intents and purposes, I am a murderess.\" Broomhurst met her wide, despairing eyes with an amazement which yielded to sudden pitying comprehension. \"So that is it, my darling? You are worrying about _that_? You who were as loyal as--\" She stopped him with a frantic gesture. \"Don't! _don't!_\" she wailed. \"If you only knew! Let me try to tell you--will you?\" she urged, pitifully. \"It may be better if I tell some one--if I don't keep it all to myself, and think, and _think_.\" She clasped her hands tight, with the old gesture he remembered when she was struggling for self-control, and waited a moment. Presently she began to speak in a low, hurried tone: \"It began before you came. I know now what the feeling was that I was afraid to acknowledge to myself. I used to try and smother it; I used to repeat things to myself all day--poems, stupid rhymes--_anything_ to keep my thoughts quite underneath--but I--_hated_ John before you came! We had been married nearly a year then. I never loved him. Of course you are going to say, 'Why did you marry him?'\" She looked drearily over the placid sea. \"Why _did_ I marry him? I don't know; for the reason that hundreds of ignorant, inexperienced girls marry, I suppose. My home wasn't a happy one. I was miserable, and oh--_restless_. I wonder if men know what it feels like to be restless? Sometimes I think they can't even guess. John wanted me very badly; nobody wanted me at home particularly. There didn't seem to be any point in my life. Do you understand? . . . Of course, being alone with him in that little camp in that silent plain\"--she shuddered--\"made things worse. My nerves went all to pieces. Everything he said, his voice, his accent, his walk, the way he ate, irritated me so that I longed to rush out sometimes and shriek--and go _mad_. Does it sound ridiculous to you to be driven mad by such trifles? I only know I used to get up from the table sometimes and walk up and down outside, with both hands over my mouth to keep myself quiet. And all the time I _hated_ myself--how I hated myself! I never had a word from him that wasn't gentle and tender. I believe he loved the ground I walked on. Oh, it is _awful_ to be loved like that when you--\" She drew in her breath with a sob. \"I--I--it made me sick for him to come near me--to touch me.\" She stopped a moment. Broomhurst gently laid his hand on her quivering one. \"Poor little girl!\" he murmured. \"Then _you_ came,\" she said, \"and before long I had another feeling to fight against. At first I thought it couldn't be true that I loved you--it would die down. I think I was _frightened_ at the feeling; I didn't know it hurt so to love any one.\" Broomhurst stirred a little. \"Go on,\" he said, tersely. \"But it didn't die,\" she continued, in a trembling whisper, \"and the other _awful_ feeling grew stronger and stronger--hatred; no, that is not the word--_loathing_ for--for--John. I fought against it. Yes,\" she cried, feverishly, clasping and unclasping her hands; \"Heaven knows I fought it with all my strength, and reasoned with myself, and--oh, I did _everything_, but--\" Her quick-falling tears made speech difficult. \"Kathleen!\" Broomhurst urged, desperately, \"you couldn't help it, you poor child. You say yourself you struggled against your feelings. You were always gentle; perhaps he didn't know.\" \"But he did--he _did_,\" she wailed; \"it is just that. I hurt him a hundred times a day; he never said so, but I knew it; and yet I _couldn't_ be kind to him,--except in words,--and he understood. And after you came it was worse in one way, for he knew--I _felt_ he knew--that I loved you. His eyes used to follow me like a dog's, and I was stabbed with remorse, and I tried to be good to him, but I couldn't.\" \"But--he didn't suspect--he trusted you,\" began Broomhurst. \"He had every reason. No woman was ever so loyal, so--\" \"Hush!\" she almost screamed. \"Loyal! it was the least I could do--to stop you, I mean--when you--After all, I knew it without your telling me. I had deliberately married him without loving him. It was my own fault. I felt it. Even if I couldn't prevent his knowing that I hated him, I could prevent _that_. It was my punishment. I deserved it for _daring_ to marry without love. But I didn't spare John one pang after all,\" she added, bitterly. \"He knew what I felt toward him; I don't think he cared about anything else. You say I mustn't reproach myself? When I went back to the tent that morning--when you--when I stopped you from saying you loved me, he was sitting at the table with his head buried in his hands; he was crying--bitterly. I saw him,--it is terrible to see a man cry,--and I stole away gently, but he saw me. I was torn to pieces, but I _couldn't_ go to him. I knew he would kiss me, and I shuddered to think of it. It seemed more than ever not to be borne that he should do that--when I knew _you_ loved me.\" \"Kathleen,\" cried her lover, again, \"don't dwell on it all so terribly--don't--\" \"How can I forget?\" she answered, despairingly. \"And then,\"--she lowered her voice,--\"oh, I can't tell you--all the time, at the back of my mind somewhere, there was a burning wish that he might _die_. I used to lie awake at night, and, do what I would to stifle it, that thought used to _scorch_ me, I wished it so intensely. Do you believe that by willing one can bring such things to pass?\" she asked, looking at Broomhurst with feverishly bright eyes. \"No? Well, I don't know. I tried to smother it,--I _really_ tried,--but it was there, whatever other thoughts I heaped on the top. Then, when I heard the horse galloping across the plain that morning, I had a sick fear that it was _you_. I knew something had happened, and my first thought when I saw you alive and well, and knew it was _John_, was _that it was too good to be true_. I believe I laughed like a maniac, didn't I? . . . Not to blame? Why, if it hadn't been for me he wouldn't have died. The men say they saw him sitting with his head uncovered in the burning sun, his face buried in his hands--just as I had seen him the day before. He didn't trouble to be careful; he was too wretched.\" She paused, and Broomhurst rose and began to pace the little hillside path at the edge of which they were seated. Presently he came back to her. \"Kathleen, let me take care of you,\" he implored, stooping toward her. \"We have only ourselves to consider in this matter. Will you come to me at once?\" She shook her head sadly. Broomhurst set his teeth, and the lines round his mouth deepened. He threw himself down beside her on the heather. \"Dear,\" he urged, still gently, though his voice showed he was controlling himself with an effort, \"you are morbid about this. You have been alone too much; you are ill. Let me take care of you; I _can_, Kathleen,--and I love you. Nothing but morbid fancy makes you imagine you are in any way responsible for--Drayton's death. You can't bring him back to life, and--\" \"No,\" she sighed, drearily, \"and if I could, nothing would be altered. Though I am mad with self-reproach, I feel _that_--it was all so inevitable. If he were alive and well before me this instant, my feeling toward him wouldn't have changed. If he spoke to me he would say 'my dear'--and I should _loathe_ him. Oh, I know! It is _that_ that makes it so awful.\" \"But if you acknowledge it,\" Broomhurst struck in, eagerly, \"will you wreck both of our lives for the sake of vain regrets? Kathleen, you never will.\" He waited breathlessly for her answer. \"I won't wreck both our lives by marrying again without love on my side,\" she replied, firmly. \"I will take the risk,\" he said. \"You _have_ loved me; you will love me again. You are crushed and dazed now with brooding over this--this trouble, but--\" \"But I will not allow you to take the risk,\" Kathleen answered. \"What sort of woman should I be to be willing again to live with a man I don't love? I have come to know that there are things one owes to _one's self_. Self-respect is one of them. I don't know how it has come to be so, but all my old feeling for you has _gone_. It is as though it had burned itself out. I will not offer gray ashes to any man.\" Broomhurst, looking up at her pale, set face, knew that her words were final, and turned his own aside with a groan. \"Ah,\" cried Kathleen, with a little break in her voice, \"_don't!_ Go away, and be happy and strong, and all that I loved in you. I am so sorry--so sorry to hurt you. I--\" her voice faltered miserably; \"I--I only bring trouble to people.\" There was a long pause. \"Did you never think that there is a terrible vein of irony running through the ordering of this world?\" she said, presently. \"It is a mistake to think our prayers are not answered--they are. In due time we get our heart's desire--when we have ceased to care for it.\" \"I haven't yet got mine,\" Broomhurst answered, doggedly, \"and I shall never cease to care for it.\" She smiled a little, with infinite sadness. \"Listen, Kathleen,\" he said. They had both risen, and he stood before her, looking down at her. \"I will go now, but in a year's time I shall come back. I will not give you up. You shall love me yet.\" \"Perhaps--I don't think so,\" she answered, wearily. Broomhurst looked at her trembling lips a moment in silence; then he stooped and kissed both her hands instead. \"I will wait till you tell me you love me,\" he said. She stood watching him out of sight. He did not look back, and she turned with swimming eyes to the gray sea and the transient gleams of sunlight that swept like tender smiles across its face. "}]